app/views/pictures/_vote_form.html.erb

    <%= f.label :picture_id %><br />
    <%= f.collection_select :picture_id, Picture.all, :id, :url %>
---
SELECT "pictures".* FROM "pictures"