app/views/pictures/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = 18
---
					<br />
					<% image.comments.each do |note| %>