app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "created_at", "picture_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "New test comment"], ["created_at", Wed, 07 Nov 2012 13:34:45 UTC +00:00], ["picture_id", nil], ["updated_at", Wed, 07 Nov 2012 13:34:45 UTC +00:00], ["user_id", nil]]
---
	def create
		#p = Picture.find_by_id(params[:id])
		c = Comment.new
		c.comment = params[:comment]
		#c.picture_id = p.id
		c.save

SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = 37 LIMIT 1
---
	def show
		@comments = Comment.find_by_picture_id(params[:id])