app/controllers/pictures_controller.rb

	def edit
	    @pictures = Picture.find_by_id(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 27 LIMIT 1

	def create
		@p = Picture.new(params[:picture])

		respond_to do |format|
			if @p.save
---
INSERT INTO "pictures" ("created_at", "favorite", "not", "updated_at", "url") VALUES (?, ?, ?, ?, ?)

	def update
		p = Picture.find_by_id(params[:id])
		p.url = params["picture"]["url"]
		p.save
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 27 LIMIT 1
UPDATE "pictures" SET "url" = NULL, "updated_at" = '2012-10-25 04:22:38.492563' WHERE "pictures"."id" = 27

	def destroy
		@p = Picture.find_by_id(params[:id])
		@p.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 28 LIMIT 1
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 28]]

	def show
		@vote = Vote.new
		@pic_id = Picture.find_by_id(params[:id])
		@comments = Comment.where(:picture_id => params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 2 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = 37 LIMIT 1

	def comment_create
		@p = Picture.find_by_id(params[:id])
		@c = Comment.new
		@c.comment = params[:comment]
		@c.picture_id = @p.id

		respond_to do |format|
			if @c.save
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" IS NULL LIMIT 1
INSERT INTO "comments" ("comment", "created_at", "picture_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["created_at", Wed, 07 Nov 2012 16:31:16 UTC +00:00], ["picture_id", 30], ["updated_at", Wed, 07 Nov 2012 16:31:16 UTC +00:00], ["user_id", nil]]

	def comment_index
		@comments = Comment.all.reverse
---
SELECT "comments".* FROM "comments"

	def comment_show
		@comments = Comment.where(:picture_id => params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = 37 LIMIT 1

	def comment_destroy
		@c = Comment.find_by_id(params[:id])
		@c.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 3 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]