app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "avatar" = '', "email" = 'rashad@getskinclick.com', "password_digest" = '$2a$10$a91RTVuFApXJIR1jmmesoOxLFUUmFvKqysT0YObB0.LiFliBxPnJu', "updated_at" = '2012-11-14 14:27:31.094134' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])