app/controllers/votes_controller.rb

  def show
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @vote = Vote.new
    @vote.picture_id = params[:vote][:picture_id]
    @vote.user_id = session["user_id"]

    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("created_at", "picture_id", "updated_at", "user_id", "vote") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Nov 2012 00:04:52 UTC +00:00], ["picture_id", 18], ["updated_at", Sun, 11 Nov 2012 00:04:52 UTC +00:00], ["user_id", nil], ["vote", 1]]